config/cf/Catalogs/Спринты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Спринты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/Спринты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
#Область ПравилаСобытий

// Функция - Все условия правил событий для объекта.
// 
// Возвращаемое значение:
//  Соответствие - соответствие с условиями.
//
Функция УсловияПравилаСобытий() Экспорт
	
	СоответствиеИзменениеОбъекта     = Новый Соответствие;	
	СоответствиеПериодическоеСобытие = Новый Соответствие;
	
	СоответствиеРасчетМетрик = Новый Соответствие;
	СоответствиеРасчетМетрик.Вставить("СпринтыРасчетМетрикЗаписьЭлемента", НСтр("ru = 'Запись элемента'"));

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("СоответствиеИзменениеОбъекта", 	  СоответствиеИзменениеОбъекта);
	Соответствие.Вставить("СоответствиеПериодическоеСобытие", СоответствиеПериодическоеСобытие);
	Соответствие.Вставить("СоответствиеРасчетМетрик", 		  СоответствиеРасчетМетрик);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти	

#КонецОбласти

#Область ОбработчикиСобытий

// Формирует список не завершенных спринтов
// 
Функция АвтоПодборСпринтовВыполнения() Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 5
		|	Спринты.Ссылка КАК Спринт
		|ИЗ
		|	Справочник.Спринты КАК Спринты
		|ГДЕ
		|	Спринты.ПометкаУдаления = ЛОЖЬ
		|	И Спринты.Завершен = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Спринты.ДатаОкончания";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Спринт");
	
КонецФункции

// Формирует список не завершенных спринтов
// 
Функция АвтоПодборСпринтСоздания(Знач ДатаАктуальности = Неопределено) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Спринты.Ссылка КАК Спринт,
		|	Спринты.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	Справочник.Спринты КАК Спринты
		|ГДЕ
		|	Спринты.ПометкаУдаления = ЛОЖЬ
		|	И Спринты.ДатаНачала <= &ДатаАктуальности
		|
		|УПОРЯДОЧИТЬ ПО
		|	Спринты.ДатаНачала УБЫВ";
	
	Если ДатаАктуальности = Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Иначе
		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Спринт");
	
КонецФункции

#КонецОбласти

#КонецЕсли
